In [31]:
# Ponemos como ruta principal la carpeta padre de "soluciones"
# para que las rutas relativas queden igual que en la carpeta de notebooks
import paths

# Otras dependencias
import pandas as pd

### Ejercicio

* Carga en un dataframe de pandas el csv `dat/alquiler-madrid-municipios.csv` en una variable que se llame `alquiler_municipios`
* Examina las primeras y últimas filas
* Extrae el número de filas y columnas

In [ ]:
# Lectura en un dataframe del fichero CSV
alquiler_municipios = pd.read_csv("dat/alquiler-madrid-distritos.csv")

# Examino las primeras filas
alquiler_municipios.head()

In [33]:
# Examino las últimas filas
alquiler_municipios.tail()

              distrito   ano  quarter     precio
835             Tetuan  2018        2  15.114558
836              Usera  2018        2  11.533458
837          Vicálvaro  2018        2   9.962139
838  Villa De Vallecas  2018        2  10.915967
839         Villaverde  2018        2  10.427527

In [34]:
# Extraigo el número de filas y columnas: (filas, columnas)
alquiler_municipios.shape

(840, 4)

#### Ejercicio

* Muestra las primeras 5 filas usando `iloc`
* Muestra las últimas 5 filas usando `iloc`

In [35]:
alquiler_municipios.iloc[0:5]

      distrito   ano  quarter     precio
0   Arganzuela  2007        2  13.066587
1      Barajas  2007        2  11.199855
2  Carabanchel  2007        2  11.127661
3       Centro  2007        2  17.746404
4    Chamartín  2007        2  14.386480

In [36]:
alquiler_municipios.iloc[-5:]

              distrito   ano  quarter     precio
835             Tetuan  2018        2  15.114558
836              Usera  2018        2  11.533458
837          Vicálvaro  2018        2   9.962139
838  Villa De Vallecas  2018        2  10.915967
839         Villaverde  2018        2  10.427527

#### Ejercicio

Muestra sobre `alquiler_nuevo_indice` las filas para distrito `Retiro` y año 2012.

In [37]:
alquiler_nuevo_indice = alquiler_municipios.set_index(['distrito', 'ano', 'quarter']).sort_index()

In [38]:
alquiler_nuevo_indice.loc[('Retiro', 2012)]

            precio
quarter
1        12.601891
2        12.363832
3        12.167435
4        11.951317

#### Ejercicio

Extrae los nombres de los distritos cuyo precio por metro cuadrado es superior a 15€ en el año y trimestre más reciente del que tenemos datos (míralo imprimiento las últimas filas de la tabla).

In [39]:
# 1. Imprime las últimas filas de la tabla
alquiler_municipios.tail()

              distrito   ano  quarter     precio
835             Tetuan  2018        2  15.114558
836              Usera  2018        2  11.533458
837          Vicálvaro  2018        2   9.962139
838  Villa De Vallecas  2018        2  10.915967
839         Villaverde  2018        2  10.427527

In [40]:
# 2. Haz el filtro. Una vez hecho, saca solo la columna distrito
filtro_ultimos_datos = alquiler_municipios[(alquiler_municipios.precio >= 15)&(alquiler_municipios.quarter == 2)&(alquiler_municipios.ano == 2018)]

In [41]:
filtro_ultimos_datos

      distrito   ano  quarter     precio
822     Centro  2018        2  18.812639
823  Chamartín  2018        2  16.606506
824   Chamberí  2018        2  17.749769
829    Moncloa  2018        2  15.189176
832     Retiro  2018        2  15.767861
833  Salamanca  2018        2  19.089243
835     Tetuan  2018        2  15.114558

In [42]:
filtro_ultimos_datos['distrito']

822       Centro
823    Chamartín
824     Chamberí
829      Moncloa
832       Retiro
833    Salamanca
835       Tetuan
Name: distrito, dtype: object

#### Ejercicio

Extrae de mayor a menor por precio las filas de la tabla para Tetuán a partir del año 2017.

In [43]:
#Generamos el filtro para recoger los datos de Tetúan a partir del 2017
filtro_tetuan = alquiler_municipios[(alquiler_municipios.distrito == 'Tetuan')&(alquiler_municipios.ano >= 2017)]
#Ordenadamos de mayor a menor por precio las filas filtradas
filtro_tetuan.sort_values(['precio'], ascending=False)

    distrito   ano  quarter     precio
793   Tetuan  2017        4  15.332326
835   Tetuan  2018        2  15.114558
814   Tetuan  2018        1  15.070236
772   Tetuan  2017        3  14.949865
730   Tetuan  2017        1  14.528777
751   Tetuan  2017        2  14.152455

#### Ejercicio

Crea una nueva columna `precio_120m` sobre `alquiler_2` que represente el precio de 120 metros cuadrados, pero utilizando `apply` y una función `lambda`.

In [44]:
#Hacemos una copia de los datos
alquiler_2 = alquiler_municipios.copy()
#Generamos la nueva columna con el precio total de 120m cuadrados
alquiler_2['precio_120m'] = alquiler_2.apply(lambda fila: fila.precio * 120, axis=1)
#Comprobamos el resultado con las primeras filas
alquiler_2.head()

      distrito   ano  quarter     precio  precio_120m
0   Arganzuela  2007        2  13.066587  1567.990475
1      Barajas  2007        2  11.199855  1343.982565
2  Carabanchel  2007        2  11.127661  1335.319359
3       Centro  2007        2  17.746404  2129.568457
4    Chamartín  2007        2  14.386480  1726.377541

#### Ejercicio

Extrae los cuantiles 0.1 y 0.9 del precio para el distrito `Tetuan`.

In [45]:
#Generamos el filtro de los precios de Tetúan
filtro_tetuan = alquiler_municipios[(alquiler_municipios.distrito == 'Tetuan')]
#Extraemos los cuantiles 0.1 y 0.9
filtro_tetuan[['precio']].quantile([.1, .9])

        precio
0.1  11.118501
0.9  14.954030

#### Ejercicio

Extrae el precio máximo histórico para cada distrito a partir del 2010

In [46]:
filtro_ano = alquiler_municipios[(alquiler_municipios.ano >= 2010)] 
filtro_ano.groupby('distrito').precio.max()

distrito
Arganzuela            14.851932
Barajas               12.748770
Carabanchel           11.657143
Centro                19.308607
Chamartín             16.606506
Chamberí              17.749769
Ciudad Lineal         13.061230
Fuencarral            12.120647
Hortaleza             13.429745
Latina                11.479019
Moncloa               15.189176
Moratalaz             10.992474
Puente De Vallecas    11.875100
Retiro                15.918052
Salamanca             19.089243
San Blas              11.808424
Tetuan                15.332326
Usera                 11.533458
Vicálvaro             10.129708
Villa De Vallecas     10.915967
Villaverde            10.427527
Name: precio, dtype: float64

#### Ejercicio

* Carga en un DataFrame el CSV `dat/venta-madrid-distritos.csv`
* Crúzalo con el que ya tenemos de alquiler. El objetivo es tener, para cada distrito, año y cuatrimestre, tanto el precio de alquiler como el de venta del metro cuadrado. Para saber cómo poner sufijos a las columnas que colisionan en el cruce, mira la documentación de `merge`.
* Extrae los precios medios de venta y alquiler por distrito para todo el histórico
* Extrae, para el año y cuatrimestre más reciente del que haya datos, el distrito donde es más rentable comprar una vivienda para destinarla a alquiler. Es decir, con el ratio precio alquiler / precio venta más alto.

In [47]:
#Cargamos el data frame 
venta_madrid_distritos = pd.read_csv("dat/venta-madrid-distritos.csv")
#Mergeamos los datos
datos_totales = pd.merge(alquiler_municipios, venta_madrid_distritos, how='inner', on=['distrito', 'ano', 'quarter'])
#Extraemos los precios medios de venta y alquiler
datos_totales.groupby('distrito').agg({'precio_x': ['mean'], 'precio_y': ['mean']}).head()

              precio_x     precio_y
                  mean         mean
distrito
Arganzuela   12.340657  3103.086354
Barajas      10.835534  2945.081544
Carabanchel   9.944685  2052.387996
Centro       15.616190  3753.839907
Chamartín    13.689511  4260.073482

In [48]:
#Extraemos el ratio precio alquiler/precio venta más alto
#Generamos la columna con todos los ratios
datos_totales["ratio precio alq/vent"] = datos_totales["precio_x"]/ datos_totales["precio_y"]
#Buscamos el año y cuatrimestre más reciente
datos_totales.tail().iloc[0:5]
#Hacemos un filtro con los datos del año y cuatrimestre más reciente
datos_filtrados_totales = datos_totales[(datos_totales.ano == 2018)&(datos_totales.quarter == 2)] 
#Extraemos el distrito más rentable
datos_filtrados_totales.loc[datos_filtrados_totales['ratio precio alq/vent'].idxmax()]

distrito                 Puente De Vallecas
ano                                    2018
quarter                                   2
precio_x                            11.8751
precio_y                            1732.72
ratio precio alq/vent            0.00685346
Name: 792, dtype: object